from somewhere import token
from collections import OrderedDict
d = {"start": ["Ищут", "Хотят стать"],
     "category": ["Суррогатные мамы",
                  "Доноры ооцитов",
                  "Доноры спермы"],
     "filters": {"Возраст": [],
                 "Вес": [],
                 "Рост": [],
                 "Свои дети": ["Есть", "Нет"],
                 "Группа крови": ["O(I) Rh-",
                                  "O(I) Rh+",
                                  "A(II) Rh-",
                                  "A(II) Rh+",
                                  "B(III) Rh−",
                                  "B(III) Rh+",
                                  "AB(IV) Rh-",
                                  "AB(IV) Rh+"],
                 "Город": []}}


user_dict_update = {"start": "",
                    "category": "",
                    "Возраст": [],
                    "Вес": [],
                    "Рост": [],
                    "Дети": [],
                    "Группа крови": [],
                    "Город":  []}

print(user_dict_update)
filter_state = [4, 5, 6, 7, 8, 9]
state = {
    "start": 1,
    "category": 2,
    "filters": 3,
    "age": 4,
    "height": 5,
    "weight": 6,
    "child": 7,
    "blood": 8,
    "city": 9,
    "ready":10

}
board_field_dict = {
                    'content': "Текст объявления",
                    'blood': "Кровь",
                    'price': "Возраст",
                    'weight': "Вес",
                    'height': "Рост",
                    'email': "email",
                    'phone': "Телефон",
                    'children': "Дети",
                    'nation': "Национальность",
                    'date_pub': "Дата публикации",
                    'city': "Город"
                    }

category_field = {23:"Ищут сурогатную маму",
                  20: "Ищут донора ооцитов",
                  15:"Ищут донора спермы",
                  22:"Хотят стать сурогатной мамой",
                  19: "Хотят стать донором ооцитов",
                  16: "Хотят стать донором спермы"
                }
main_dict = {"start": ["Ищут", "Хотят стать"],
            "category": ["Суррогатные мамы",
                        "Доноры ооцитов",
                        "Доноры спермы"],
            "filter":{  
                        "age": [4, "Возраст", "Введите возраст (например: 20-42) или нажмите назад",()],
                        "weight": [5, "Вес", "Введите вес (например: 70-95) или нажмите назад",()],
                        "height": [6, "Рост", "Введите рост (например: 170-180) или нажмите Назад",()],
                        "child": [7, "Дети", "Выберете из списка ниже",("Есть", "Нет")],
                        "blood": [8, "Группа крови", "Выберете из списка ниже", ("O(I) Rh-",
                                                                                "O(I) Rh+",
                                                                                "A(II) Rh-",
                                                                                "A(II) Rh+",
                                                                                "B(III) Rh−",
                                                                                "B(III) Rh+",
                                                                                "AB(IV) Rh-",
                                                                                "AB(IV) Rh+")],
                        "city": [9, "Город" ,"Введите город(например: Москва) или нажмите Назад",()],
                        },
            "ready" : [
                    "Сбросить фильтры",
                    "Вернуться к категориям",
                    "Сбросить все"]
}
